Requests_control/src/Catalogs/Обращения/Обращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Обращения</name>
  <attributes>
    <name>ВидОбращения</name>
    <type>
      <types>CatalogRef.ВидыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеВопросыНаРассмотрении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоОбращению</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Заявители</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ОрганыИУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбратившихся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотрения</name>
    <comment>Плановый срок рассмотрения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотренияПервоначальный</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.Вопросы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтвета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящаяДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящийНомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОМерах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОРезультатах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганДляПередачи</name>
      <type>
        <types>CatalogRef.ОрганыИУчреждения</types>
      </type>
    </attributes>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатРассмотрения</name>
      <type>
        <types>EnumRef.РезультатыРассмотрения</types>
      </type>
    </attributes>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.Темы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тематика</name>
      <type>
        <types>CatalogRef.Тематики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Requests_control/src/Enums/ТипыОбращений/ТипыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбращений</name>
  <enumValues>
    <name>Персональное</name>
  </enumValues>
  <enumValues>
    <name>Коллективное</name>
  </enumValues>
  <enumValues>
    <name>Анонимное</name>
  </enumValues>
</mdclass:Enum>

Requests_control/src/Catalogs/Обращения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Программный_интерфейс

Функция ПолучитьНаименованиеОбъекта(Объект) Экспорт
	
	Наименование = "";
	
	Если Не (ТипЗнч(Объект) = Тип("СправочникОбъект.Обращения") Или ТипЗнч(Объект) = Тип("СправочникСсылка.Обращения")) Тогда
		Возврат Наименование;
	КонецЕсли;
	
	РеквизитыОбъекта = Объект;
	Если РеквизитыОбъекта = Тип("СправочникСсылка.Обращения") Тогда
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			РеквизитыОбъекта,
			"ТипОбращения, ВидОбращения, Заявитель, НомерДокумента, ДатаДокумента");
	КонецЕсли;
	
	Если РеквизитыОбъекта.ТипОбращения = Перечисления.ТипыОбращений.Анонимное Тогда
		Наименование = НСтр("ru = 'Анонимное обращение'");
	ИначеЕсли ПолучитьФункциональнуюОпцию("УчитыватьВидыОбращений") И ЗначениеЗаполнено(РеквизитыОбъекта.ВидОбращения) Тогда
		Наименование = Строка(РеквизитыОбъекта.ВидОбращения) + " " 
			+ НСтр("ru = 'от'") + " " 
			+ Строка(РеквизитыОбъекта.Заявитель);
	Иначе
		Наименование = НСтр("ru = 'Обращение'") + " " + НСтр("ru = 'от'") + " " + Строка(РеквизитыОбъекта.Заявитель);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(РеквизитыОбъекта.НомерДокумента) Тогда 
		Наименование = Наименование + " " +
			СтрШаблон(НСтр("ru = '№ %1 от %2'"), 
				РеквизитыОбъекта.НомерДокумента, Формат(РеквизитыОбъекта.ДатаДокумента, "ДЛФ=D"));
	КонецЕсли;	
	
	Возврат Наименование;
	
КонецФункции

Функция ПолучитьСписокОбращенийПоЗаявителю(Заявитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заявитель", Заявитель);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Обращения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Обращения КАК Обращения
		|ГДЕ
		|	Обращения.Заявитель = &Заявитель";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ОбновитьОбращенияПриИзмененииЗаявителя(Заявитель) Экспорт
	
	СписокОбращенийЗаявителя = Справочники.Обращения.ПолучитьСписокОбращенийПоЗаявителю(Заявитель);
		
	Попытка 
		Для Каждого ЭлементСписка Из СписокОбращенийЗаявителя Цикл
			Обращение = ЭлементСписка.ПолучитьОбъект();
			Обращение.Заблокировать();
			Обращение.Наименование = Справочники.Обращения.ПолучитьНаименованиеОбъекта(Обращение);
			Обращение.ОбменДанными.Загрузка = Истина;
			Обращение.Записать();
		КонецЦикла;
	Исключение
		ВызватьИсключение СтрШаблон(
			Нстр("ru = 'При обновлении обращений заявителя произошла ошибка:
				|%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;	
	
КонецПроцедуры

Функция ОбращенияЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Обращения.Ссылка
		|ИЗ
		|	Справочник.Обращения КАК Обращения
		|ГДЕ
		|	НЕ Обращения.ПометкаУдаления
		|	И (
		|		Обращения.ДатаДокумента МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		ИЛИ Обращения.ДатаПоОбращению МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		ИЛИ Обращения.ДатаПоступления МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		ИЛИ Обращения.Вопросы.ДатаОтвета МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	)
		|");
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Иначе
		Запрос.УстановитьПараметр("ДатаОкончания", Дата(2099, 1, 1));
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область Обработчики_событий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ВыбраннаяФорма = "ФормаЭлемента";
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
		ВыбраннаяФорма = "ФормаЭлемента";
	Иначе	
		ВыбраннаяФорма = "ФормаНового";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
